Examinator/src/InformationRegisters/СессииВебКабинетаСУ/СессииВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СессииВебКабинетаСУ</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСессии</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияСессии</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СохраняемоеЗначениеПароля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Права</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ПопыткиПрохожденияЭлектронныхРесурсовСУЗ/ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПопыткиПрохожденияЭлектронныхРесурсовСУЗ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяПрохожденияВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЭтоТест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПопыткаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DefinedType.ПроведениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРегистратора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сложность</name>
    <type>
      <types>CatalogRef.СложностиТестовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеИзученияЭлектронныхКурсовВебКабинетаСУО/ДанныеИзученияЭлектронныхКурсовВебКабинетаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеИзученияЭлектронныхКурсовВебКабинетаСУО</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторАктивности</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлектронныйКурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ЭлектронныеКурсы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеВебКабинетаСУЗ_ПН/ДанныеВебКабинетаСУЗ_ПН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУЗ_ПН</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыСессийЭлектронныхРесурсовСУЗ/ТипыСессийЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСессийЭлектронныхРесурсовСУЗ</name>
  <enumValues>
    <name>course</name>
  </enumValues>
  <enumValues>
    <name>staticPage</name>
  </enumValues>
  <enumValues>
    <name>SCOPage</name>
  </enumValues>
  <enumValues>
    <name>quiz</name>
  </enumValues>
  <enumValues>
    <name>answerQuestion</name>
  </enumValues>
  <enumValues>
    <name>cabinetLearning</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыДанныхВебКабинетаСУЗ/ТипыДанныхВебКабинетаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДанныхВебКабинетаСУЗ</name>
  <enumValues>
    <name>КаталогЭлектронныхРесурсов</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ПрохождениеОбученияСУО/ПрохождениеОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрохождениеОбученияСУО</name>
  <registerRecords>InformationRegister.РасписаниеОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ФайлыНаПроверкуПреподавателюСУО</registerRecords>
  <registerRecords>InformationRegister.УчастникиОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ОценкиКачестваОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.ПрохожденияОбученияСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПрохождение</name>
    <type>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращеноНаДоработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаКачестваОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКачестваОбучения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОцениванияКачестваОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставленаОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Documents/СессияЭлектронногоРесурсаСУЗ/СессияЭлектронногоРесурсаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СессияЭлектронногоРесурсаСУЗ</name>
  <registerRecords>InformationRegister.ТестыНаПроверкуСУЗ</registerRecords>
  <registerRecords>InformationRegister.ОтветыНаВопросыСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПрохожденияЭлектронныхРесурсовСУЗ</registerRecords>
  <registerRecords>InformationRegister.ВопросыТестированийСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПовторноеПрохождениеЭлектронныхРесурсовСУЗ</registerRecords>
  <registerRecords>InformationRegister.ВыбранныеВариантыОтветовВопросовСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскаяСессия</name>
    <type>
      <types>DocumentRef.СессияЭлектронногоРесурсаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСессии</name>
    <type>
      <types>EnumRef.ТипыСессийЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТекстовые</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсторияИзменений</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Данные</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеТекстовые</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/HTTPServices/ЭлектронныеРесурсыСУЗ/Module.bsl
Функция ВерсияANY(Запрос)
	УстановитьПривилегированныйРежим(Истина);	
	НастройкиAPI = Новый Структура("Версия, База", ВебКабинетСУ.ВерсияAPI(), СтандартныеПодсистемыСервер.ИдентификаторИнформационнойБазы());	
	Возврат ОтветКлиентуJSON(,НастройкиAPI);	
КонецФункции

Функция ПолучитьКаталогЭлектронныхРесурсовPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//	
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;	
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, "ЭлектронныеРесурсы");
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные
	//	
		
	РезультатЗапроса = КаталогЭлектронныхРесурсовПользователя(ДанныеСессии.Пользователь);
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат ОтветКлиентуJSON(,);
		
	Иначе
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ОтветКлиентуJSON(,ВыборкаДетальныеЗаписи.Данные);
		
	КонецЕсли;

КонецФункции

Функция ПолнотекстовыйПоискPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//	
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина, "ЭлектронныеРесурсы");
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем каталог электронных ресурсов 
	
	РезультатЗапросаЭР = КаталогЭлектронныхРесурсовПользователя(ДанныеСессии.Пользователь);
	
	Если РезультатЗапросаЭР.Пустой() Тогда
		
		Возврат ОтветКлиентуJSON(,);
		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапросаЭР.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	КаталогЭРМассив = ОбщегоНазначенияСУ.JSONВДанные(ВыборкаДетальныеЗаписи.Данные.Получить());	
	
	МассивИдентификаторовЭРДляПоиска = Новый Массив;
	
	Для каждого Строка Из КаталогЭРМассив Цикл
	
		Если Строка.ЭтоГруппа
			ИЛИ Строка.Тип = "Тест" Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		МассивИдентификаторовЭРДляПоиска.Добавить(Строка.Ссылка);
		
	КонецЦикла;
	
	// Получаем текст запроса
	
	ИндексСтраницы = Запрос.ПараметрыURL.Получить("ИндексСтраницы");

	Попытка
		ИндексСтраницы = Число(ИндексСтраницы);
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;	
	
	ЗапросПоискаJSON = СокрЛП(Запрос.ПолучитьТелоКакСтроку());
	
	Если НЕ ЗначениеЗаполнено(ЗапросПоискаJSON) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	Попытка
		ЗапросПоиска = СокрЛП(ОбщегоНазначенияСУ.JSONВДанные(ЗапросПоискаJSON).query);
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;
	
	// Выполняем поиск
	
	СтрокаПоиска = "(" + ЗапросПоиска + " НЕ ДоступноПриНаличииПраваИзмененияЭР" + ") И (";
	
	Для каждого Идентификатор Из МассивИдентификаторовЭРДляПоиска Цикл
	
		СтрокаПоиска = СтрокаПоиска + """" + Идентификатор + """ ИЛИ ";
	
	КонецЦикла;
	
	Если МассивИдентификаторовЭРДляПоиска.Количество() > 0 Тогда
		СтрокаПоиска = Лев(СтрокаПоиска, СтрДлина(СтрокаПоиска) - 5);
	КонецЕсли;	
	
	СтрокаПоиска = СтрокаПоиска + ")";
	
	СписокПоиска = ПолнотекстовыйПоиск.СоздатьСписок(СтрокаПоиска, 20);
	
	СписокПоиска.ОбластьПоиска.Добавить(Метаданные.РегистрыСведений.ДанныеДляПолнотекстовогоПоискаСУЗ);
	СписокПоиска.ИспользованиеМетаданных = ИспользованиеМетаданныхПолнотекстовогоПоиска.НеИспользовать;	
	
	Если НЕ ЗначениеЗаполнено(ИндексСтраницы) Тогда
		СписокПоиска.ПерваяЧасть();
	Иначе
		СписокПоиска.СледующаяЧасть(ИндексСтраницы-1);
	КонецЕсли;	
	
	ЧтениеXML = СписокПоиска.ПолучитьОтображение(ВидОтображенияПолнотекстовогоПоиска.XML);
	
	МанифестXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);	
	
	МассивРезультатов = Новый Массив;
	Индекс = 0;
	
	Для Каждого Результат Из СписокПоиска Цикл		
				
		НайденныйЭлемент = Новый Структура("Объект, Описание, Представление, НайденныеСлова", Новый Структура, "", Новый Массив, Новый Массив);
		
		// Чтобы получить описание, мы берем первый элемент textPortion
		// и получаем его XML в виде строки. Это будет описание.
		
		Если ТипЗнч(МанифестXDTO.item) = Тип("ОбъектXDTO") Тогда			
			ОписаниеXDTO = МанифестXDTO.item.textPortion.Получить(0);						
		Иначе
			Если ТипЗнч(МанифестXDTO.item.Получить(Индекс).textPortion) = Тип("ОбъектXDTO") Тогда
				ОписаниеXDTO = МанифестXDTO.item.Получить(Индекс).textPortion.foundWord;
			Иначе				
				ОписаниеXDTO = МанифестXDTO.item.Получить(Индекс).textPortion.Получить(0);
			КонецЕсли;
		КонецЕсли;			
		
		Если ТипЗнч(ОписаниеXDTO) = Тип("Строка") Тогда
			
			НайденныйЭлемент.НайденныеСлова.Добавить(ОписаниеXDTO);
			
		ИначеЕсли ТипЗнч(ОписаниеXDTO.foundWord) = Тип("СписокXDTO") Тогда
			
			Для каждого foundWord Из ОписаниеXDTO.foundWord Цикл			
				НайденныйЭлемент.НайденныеСлова.Добавить(foundWord);			
			КонецЦикла;
			
		Иначе
			
			НайденныйЭлемент.НайденныеСлова.Добавить(ОписаниеXDTO.foundWord);
			
		КонецЕсли;		
		
		Если ТипЗнч(ОписаниеXDTO) = Тип("Строка") Тогда
			НайденныйЭлемент.Описание = ОписаниеXDTO;
		Иначе
			ЗаписьXML = Новый ЗаписьXML;
			ЗаписьXML.УстановитьСтроку();
			ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОписаниеXDTO);
			НайденныйЭлемент.Описание = ЗаписьXML.Закрыть();					
		КонецЕсли;
	
		
		ПредставлениеМассив = ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(Результат.Представление, ";");
		КоличествоЭлементовПредставления = ПредставлениеМассив.Количество();		
		
		Если КоличествоЭлементовПредставления > 0 Тогда 
			НайденныйЭлемент.Представление.Добавить(ПредставлениеМассив[0]);
		КонецЕсли;
		
		Если КоличествоЭлементовПредставления > 1 Тогда 
			НайденныйЭлемент.Представление.Добавить(ПредставлениеМассив[1]); // Больше двух элементов не берем
		КонецЕсли;		
		
		НайденныйЭлемент.Объект.Вставить("ЭлектронныйРесурс", Новый Структура("Идентификатор", Результат.Значение.ЭлектронныйРесурс));
		НайденныйЭлемент.Объект.Вставить("ЭлементСодержания", Новый Структура("Идентификатор", Результат.Значение.ЭлементСодержания));
		НайденныйЭлемент.Объект.Вставить("ЭлементПодборки", Новый Структура("Идентификатор", Результат.Значение.ЭлементПодборки));
		НайденныйЭлемент.Объект.Вставить("ЭлементГлоссария", Новый Структура("Идентификатор", Результат.Значение.ЭлементГлоссария));
		НайденныйЭлемент.Объект.Вставить("СсылкаНаОбъектСУЗ", Новый Структура("Идентификатор", Результат.Значение.СсылкаНаОбъектСУЗ));
		
		МассивРезультатов.Добавить(НайденныйЭлемент);
		
		Индекс = Индекс + 1;
		
	КонецЦикла;	
		
	// Возвращаем результат
	
	Возврат ОтветКлиентуJSON(,Новый Структура("
		| РезультатыПоиска,
		| Количество,
		| СлишкомМногоРезультатов,
		| РазмерПорции",
		МассивРезультатов,
		СписокПоиска.ПолноеКоличество(),
		СписокПоиска.СлишкомМногоРезультатов(),
		СписокПоиска.РазмерПорции
	));
	
КонецФункции

Функция ПолучитьАдресПубликацииPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//	
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем параметры
	
	НастройкиДляЗаписиJSON = СокрЛП(Запрос.ПолучитьТелоКакСтроку());
	
	Если НЕ ЗначениеЗаполнено(НастройкиДляЗаписиJSON) Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	Попытка
		НастройкиДляЗаписи = ОбщегоНазначенияСУ.JSONВДанные(НастройкиДляЗаписиJSON);
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;
	
	search = Неопределено;
	base = Неопределено;
	closeURL = Неопределено;
	
	НастройкиДляЗаписи.Свойство("search", search);
	НастройкиДляЗаписи.Свойство("base", base);
	НастройкиДляЗаписи.Свойство("closeURL", closeURL);
	
	Если search = Неопределено ИЛИ base = Неопределено Тогда
		Возврат ОтветКлиентуJSON("errorData");			
	КонецЕсли;
	
	РезультатПолученияАдреса = ЭлектронныеРесурсыСУЗ.АдресПубликацииЭлектронногоРесурса(search, base, closeURL);  
	
	Если ЗначениеЗаполнено(РезультатПолученияАдреса.КодОшибки) Тогда
		Возврат ОтветКлиентуJSON(РезультатПолученияАдреса.КодОшибки, Новый Структура("Адрес", search));
	КонецЕсли;
	
	ДанныеДляВозврата = Новый Структура("Адрес, РазмещеныДанныеДляВебКабинета, КонтрольнаяСумма");
	ДанныеДляВозврата.Адрес = РезультатПолученияАдреса.Адрес;
	ДанныеДляВозврата.РазмещеныДанныеДляВебКабинета = РезультатПолученияАдреса.РазмещеныДанныеДляВебКабинета;
	ДанныеДляВозврата.КонтрольнаяСумма = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(РезультатПолученияАдреса.КонтрольнаяСумма);	
	
	Возврат ОтветКлиентуJSON(,ДанныеДляВозврата);
		
КонецФункции

Функция ПолучитьДанныеИзученияВКабинетеPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//	
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;	
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	
	// Получаем данные контекста запроса
	//	
	
	Попытка
		ДанныеИзученияСтруктура = ИзучениеЭлектронныхКурсовСлужебный.ДанныеИзученияСтруктураИзСтроки(Запрос.ПолучитьТелоКакСтроку());
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;
	
	Если НЕ ДанныеИзученияСтруктура.Свойство("context") Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
		
	Попытка
		ЭлектронныйРесурс = Справочники.СводыЗнанийСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(
			ДанныеИзученияСтруктура.context.electronicResource));
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;
		
	Попытка
		Пользователь = Справочники.Пользователи.ПолучитьСсылку(
			Новый УникальныйИдентификатор(ДанныеИзученияСтруктура.context.user));	
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;
	
	Если ДанныеИзученияСтруктура.context.Свойство("userActivity") Тогда
		Попытка
			ПрохождениеОбучения = Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(
				ДанныеИзученияСтруктура.context.userActivity));
		Исключение
			Возврат ОтветКлиентуJSON("errorData");
		КонецПопытки;
	Иначе
		ПрохождениеОбучения = Документы.ПрохождениеОбученияСУО.ПустаяСсылка();
	КонецЕсли;

	Если ДанныеИзученияСтруктура.context.Свойство("task") Тогда
		
		ИдентификаторЗадания = Новый УникальныйИдентификатор(ДанныеИзученияСтруктура.context.task);
		
		Задание = Справочники.СводыЗнанийСУЗ.ПолучитьСсылку(ИдентификаторЗадания);
		
		Если НЕ ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(Задание, Ложь) Тогда
			Задание = Справочники.ЗаданияСУО.ПолучитьСсылку(ИдентификаторЗадания);
		КонецЕсли;
		
		Если НЕ ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(Задание, Ложь) Тогда
			Возврат ОтветКлиентуJSON("errorData");
		КонецЕсли;
		
	Иначе
		
		Задание = Справочники.ЗаданияСУО.ПустаяСсылка();
		
	КонецЕсли;
	
	Если ДанныеИзученияСтруктура.context.Свойство("providingEducation") Тогда
		Попытка
			ПроведениеОбучения = Документы.ПроведениеОбученияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(
				ДанныеИзученияСтруктура.context.providingEducation));
		Исключение
			Возврат ОтветКлиентуJSON("errorData");
		КонецПопытки;
	Иначе
		ПроведениеОбучения = Документы.ПроведениеОбученияСУО.ПустаяСсылка();
	КонецЕсли;
	
	// Получаем данные прохождения
	//
	
	КорневаяСессияПрохождения = Документы.СессияЭлектронногоРесурсаСУЗ.КорневаяСессияПрохожденияЭлектронногоКурса(Пользователь, ПрохождениеОбучения, ЭлектронныйРесурс, Задание, Перечисления.ТипыСессийЭлектронныхРесурсовСУЗ.cabinetLearning);
	
	Если ЗначениеЗаполнено(ПрохождениеОбучения) И НЕ ЗначениеЗаполнено(КорневаяСессияПрохождения) Тогда
		ЕстьПопыткиПрохожденияИзЛичногоКабинета = РегистрыСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЕстьПопыткиПрохожденияИзЛичногоКабинета(Пользователь, ПрохождениеОбучения, Задание);
		Если ЕстьПопыткиПрохожденияИзЛичногоКабинета Тогда
			Возврат "Error:" + НСтр("ru = 'Используйте личный кабинет в программе 1С для открытия электронного ресурса'");
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КорневаяСессияПрохождения) Тогда
		Возврат ОтветКлиентуJSON(,Новый Структура);
	КонецЕсли;
	
	Если ТипЗнч(КорневаяСессияПрохождения) <> Тип("ДокументСсылка.СессияЭлектронногоРесурсаСУЗ") Тогда
		Возврат ОтветКлиентуJSON("errorData");	
	КонецЕсли;
	
	ДанныеСессииСтруктура = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КорневаяСессияПрохождения, "Данные").Получить();
	
	Если НЕ ТипЗнч(ДанныеСессииСтруктура) = Тип("ФиксированнаяСтруктура")
		ИЛИ НЕ ДанныеСессииСтруктура.Свойство("uuid") Тогда
		
		Возврат ОтветКлиентуJSON("errorData");
		
	КонецЕсли;
	
	ИдентификаторАктивности = Новый УникальныйИдентификатор(ДанныеСессииСтруктура.uuid);
	
	// Получаем данные из БД
	//
	
	ВсеДанныеИзучения = РегистрыСведений.ДанныеИзученияЭлектронныхКурсовВебКабинетаСУО.ВсеДанныеИзучения(ИдентификаторАктивности, ЭлектронныйРесурс);
	
	Если НЕ ВсеДанныеИзучения.Свойство("uuid") Тогда
		ВсеДанныеИзучения.Вставить("uuid", Строка(ИдентификаторАктивности));
	КонецЕсли;
	
	Если НЕ ВсеДанныеИзучения.Свойство("course") Тогда 
		ВсеДанныеИзучения.Вставить("course", Строка(ЭлектронныйРесурс.УникальныйИдентификатор()));
	КонецЕсли;
	
	// Отдаем клиенту
	//
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ВсеДанныеИзучения);					
	
	ВсеДанныеИзученияСтрока = ЗаписьJSON.Закрыть();
	
	Возврат ОтветКлиентуСтрокаJSON(ВсеДанныеИзученияСтрока);	
	
КонецФункции

Функция СохранитьДанныеИзученияВКабинетеPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Делаем проверки сессии пользователя
	//	
	
	ДанныеСессии = Неопределено;
	КодОшибки    = Неопределено;	
	
	РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, Истина);
	
	Если КодОшибки <> Неопределено Тогда
		Возврат ОтветКлиентуJSON(КодОшибки);
	КонецЕсли;
	
	// Получаем данные контекста запроса
	//	
	
	Попытка
		ДанныеИзученияСтруктура = ИзучениеЭлектронныхКурсовСлужебный.ДанныеИзученияСтруктураИзСтроки(Запрос.ПолучитьТелоКакСтроку());
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;
	
	Если НЕ ДанныеИзученияСтруктура.Свойство("context") Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	Если НЕ ДанныеИзученияСтруктура.context.Свойство("electronicResource") Тогда
		Возврат ОтветКлиентуJSON("errorData");
	КонецЕсли;
	
	Попытка
		ЭлектронныйРесурс = Справочники.СводыЗнанийСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(
		ДанныеИзученияСтруктура.context.electronicResource));
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;
	
	Попытка
		ПользовательАктивности = Справочники.Пользователи.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ДанныеИзученияСтруктура.context.user));	
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;
	
	Если ДанныеИзученияСтруктура.context.Свойство("userActivity") Тогда
		Попытка
			ПрохождениеОбучения = Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(
			ДанныеИзученияСтруктура.context.userActivity));
		Исключение
			Возврат ОтветКлиентуJSON("errorData");
		КонецПопытки;
	Иначе
		ПрохождениеОбучения = Документы.ПрохождениеОбученияСУО.ПустаяСсылка();
	КонецЕсли;
	
	Если ДанныеИзученияСтруктура.context.Свойство("task") Тогда
		
		ИдентификаторЗадания = Новый УникальныйИдентификатор(ДанныеИзученияСтруктура.context.task);
		
		Задание = Справочники.СводыЗнанийСУЗ.ПолучитьСсылку(ИдентификаторЗадания);
		
		Если НЕ ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(Задание, Ложь) Тогда
			Задание = Справочники.ЗаданияСУО.ПолучитьСсылку(ИдентификаторЗадания);
		КонецЕсли;
		
		Если НЕ ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(Задание, Ложь) Тогда
			Возврат ОтветКлиентуJSON("errorData");
		КонецЕсли;
		
	Иначе
		
		Задание = Справочники.ЗаданияСУО.ПустаяСсылка();
		
	КонецЕсли;
	
	Попытка
		ИдентификаторАктивности =  Новый УникальныйИдентификатор(ДанныеИзученияСтруктура.context.learningActivity);
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;	
	
	Попытка
		ЭтоЗавершениеИзучения = ДанныеИзученияСтруктура.context.isTerminate;	
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;
	
	Попытка
		КонтрольнаяСумма =  Число(ДанныеИзученияСтруктура.context.checkSum);
	Исключение
		Возврат ОтветКлиентуJSON("errorData");
	КонецПопытки;
	
	Если ДанныеИзученияСтруктура.context.Свойство("providingEducation") Тогда
		Попытка
			ПроведениеОбучения = Документы.ПроведениеОбученияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(
			ДанныеИзученияСтруктура.context.providingEducation));
		Исключение
			Возврат ОтветКлиентуJSON("errorData");
		КонецПопытки;
	Иначе
		ПроведениеОбучения = Документы.ПроведениеОбученияСУО.ПустаяСсылка();
	КонецЕсли;
	
	ДанныеИзученияСтруктура.Удалить("context");
	
	// Записываем данные в регистр для хранения
	//
	
	Для каждого ЭлементСтруктуры Из ДанныеИзученияСтруктура Цикл
		
		РегистрыСведений.ДанныеИзученияЭлектронныхКурсовВебКабинетаСУО.ЗаписатьДанныеИзучения(
		ИдентификаторАктивности, ЭлектронныйРесурс, ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение, ПользовательАктивности);  	
		
	КонецЦикла;
	
	// Формируем документ СессияЭлектронногоРесурсаСУЗ
	//
	
	Если ЭтоЗавершениеИзучения Тогда
				
		КорневаяСессияПрохождения = Документы.СессияЭлектронногоРесурсаСУЗ.КорневаяСессияПрохожденияЭлектронногоКурса(ПользовательАктивности, ПрохождениеОбучения, ЭлектронныйРесурс, Задание, Перечисления.ТипыСессийЭлектронныхРесурсовСУЗ.cabinetLearning);
		
		ДанныеСессии = Новый Структура("uuid, checkSum", Строка(ИдентификаторАктивности), КонтрольнаяСумма);
		ДанныеСессии = Новый ФиксированнаяСтруктура(ДанныеСессии);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, ДанныеСессии);					
		ДанныеСессииСтрока = ЗаписьJSON.Закрыть();		
		
		НачатьТранзакцию();
		
		Попытка
			
			// Записываем документ сессии
			//
			
			Если ЗначениеЗаполнено(КорневаяСессияПрохождения) Тогда
				
				СессияОбъект = КорневаяСессияПрохождения.ПолучитьОбъект();
				
				Если СессияОбъект.Пользователь <> ПользовательАктивности
					ИЛИ СессияОбъект.ЭлектронныйРесурс <> ЭлектронныйРесурс
					ИЛИ СессияОбъект.ПрохождениеОбучения <> ПрохождениеОбучения 
					ИЛИ СессияОбъект.Задание <> Задание 
					ИЛИ СессияОбъект.ТипСессии <> Перечисления.ТипыСессийЭлектронныхРесурсовСУЗ.cabinetLearning
					ИЛИ СессияОбъект.ПометкаУдаления Тогда
					
					Возврат ОтветКлиентуJSON("errorData");
					
				КонецЕсли;
				
			Иначе				
				
				СессияОбъект = Документы.СессияЭлектронногоРесурсаСУЗ.СоздатьДокумент();
				
				СессияОбъект.Дата = ТекущаяДатаСеанса();
				СессияОбъект.Пользователь = ПользовательАктивности; 
				СессияОбъект.ЭлектронныйРесурс = ЭлектронныйРесурс;
				СессияОбъект.КонтрольнаяСумма = КонтрольнаяСумма;
				СессияОбъект.ПрохождениеОбучения = ПрохождениеОбучения;
				СессияОбъект.Задание = Задание;
				СессияОбъект.ТипСессии = Перечисления.ТипыСессийЭлектронныхРесурсовСУЗ.cabinetLearning;
				
			КонецЕсли;
			
			СессияОбъект.Данные = Новый ХранилищеЗначения(ДанныеСессии);
			СессияОбъект.ДанныеТекстовые = ДанныеСессииСтрока;		
			СессияОбъект.КонтрольнаяСумма = КонтрольнаяСумма;
			СессияОбъект.ДатаИзменения = ТекущаяДатаСеанса();
			
			ИсторияСтрока = СессияОбъект.ИсторияИзменений.Добавить();
			ИсторияСтрока.Дата = ТекущаяДатаСеанса();
			ИсторияСтрока.Данные = СессияОбъект.Данные;
			ИсторияСтрока.ДанныеТекстовые = СессияОбъект.ДанныеТекстовые;
			
			СессияОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			// Обновляем данные обучения
			// 
			
			ЭлектронныеРесурсыПереопределяемый.ПослеСохраненияДанныхПрохожденияПубликации(ЭлектронныйРесурс, ПрохождениеОбучения, Задание, ПользовательАктивности, ЭтоЗавершениеИзучения);		
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ВызватьИсключение;
			
		КонецПопытки;
		
		
		
	КонецЕсли;
	
	Возврат ОтветКлиентуJSON(,Новый Структура);
	
КонецФункции


// ОБЩИЕ (аналогичные процедуры в других HTTP-сервисах)
//

Функция КаталогЭлектронныхРесурсовПользователя(Пользователь)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеВебКабинетаСУЗ_ПН.Данные
		|ИЗ
		|	РегистрСведений.ДанныеВебКабинетаСУЗ_ПН КАК ДанныеВебКабинетаСУЗ_ПН
		|ГДЕ
		|	ДанныеВебКабинетаСУЗ_ПН.Пользователь = &Пользователь
		|	И ДанныеВебКабинетаСУЗ_ПН.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхВебКабинетаСУЗ.КаталогЭлектронныхРесурсов)
		|	И ДанныеВебКабинетаСУЗ_ПН.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Пользователь);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Возврат Запрос.Выполнить();	
	
КонецФункции

Функция ОтветКлиентуJSON(КодОшибки = "", Данные = NULL)
	
	ТекстСообщенияСтруктура = Новый Структура("error, data", КодОшибки, Данные);
	
	ТекстСообщения = ОбщегоНазначенияСУ.ДанныеВJSON(ТекстСообщенияСтруктура);

	Если ЗначениеЗаполнено(КодОшибки) Тогда
		Ответ = Новый HTTPСервисОтвет(400);
	Иначе
		Ответ = Новый HTTPСервисОтвет(200);
	КонецЕсли;
		
	Ответ.УстановитьТелоИзСтроки(ТекстСообщения);
	
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	ДобавитьЗаголовкиМежсайтовогоЗапроса(Ответ);
	
	Возврат Ответ;
	
КонецФункции

Функция ОтветКлиентуСтрокаJSON(СтрокаJSON)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	ДобавитьЗаголовкиМежсайтовогоЗапроса(Ответ);
	
	Возврат Ответ;
	
КонецФункции

Функция РазрешитьМежсайтовыеЗапросыOPTIONS(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	ДобавитьЗаголовкиМежсайтовогоЗапроса(Ответ, Истина);
	Возврат Ответ;
	
КонецФункции

Процедура ДобавитьЗаголовкиМежсайтовогоЗапроса(Ответ, ПроверитьРазрешение = Ложь)
	Если НЕ ПроверитьРазрешение ИЛИ Константы.РазрешитьЗапросыКСервисамСДругихДоменовСУ.Получить() = Истина Тогда
		Ответ.Заголовки.Вставить("Access-Control-Allow-Origin", "*");
	    Ответ.Заголовки.Вставить("Access-Control-Allow-Methods", "GET, PUT, POST, DELETE, HEAD, OPTIONS");
	    Ответ.Заголовки.Вставить("Access-Control-Allow-Credentials", "true");
	    Ответ.Заголовки.Вставить("Access-Control-Allow-Headers", "X-Requested-With, origin, content-type, accept");
	КонецЕсли;
КонецПроцедуры
